<a href="https://colab.research.google.com/github/KelvinY18/Data-Science-Python-Projects/blob/main/Assignment1_AdvancePandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
from google.colab import files
upload = files.upload()

Saving dataset_32_pendigits.csv to dataset_32_pendigits.csv

In [ ]:
data = pd.read_csv('dataset_32_pendigits.csv')
data.head()

   input1  input2  input3  input4  ...  input14  input15  input16  class
0      47     100      27      81  ...       90       40       98      8
1       0      89      27     100  ...        2      100        6      2
2       0      57      31      68  ...       25       16        0      1
3       0     100       7      92  ...       23       67        0      4
4       0      67      49      83  ...       20       47        0      1

[5 rows x 17 columns]

In [ ]:
data.tail()

       input1  input2  input3  input4  ...  input14  input15  input16  class
10987      36     100      24      70  ...       21      100        0      4
10988      16      75      41     100  ...        2      100       14      2
10989      56     100      27      79  ...       93       38       93      0
10990      19     100       0      61  ...       97       10       81      0
10991      38     100      37      81  ...       26       65        0      4

[5 rows x 17 columns]

In [ ]:
data.columns

Index(['input1', 'input2', 'input3', 'input4', 'input5', 'input6', 'input7',
       'input8', 'input9', 'input10', 'input11', 'input12', 'input13',
       'input14', 'input15', 'input16', 'class'],
      dtype='object')

In [ ]:
data.dtypes

input1       int64
input2       int64
input3       int64
input4       int64
input5       int64
input6       int64
input7       int64
input8       int64
input9       int64
input10      int64
input11    float64
input12      int64
input13      int64
input14      int64
input15      int64
input16      int64
class        int64
dtype: object

In [ ]:
data.describe()

             input1        input2  ...       input16         class
count  10992.000000  10992.000000  ...  10992.000000  10992.000000
mean      38.814320     85.120269  ...     28.845342      4.431587
std       34.257783     16.218571  ...     35.778094      2.876947
min        0.000000      0.000000  ...      0.000000      0.000000
25%        6.000000     76.000000  ...      0.000000      2.000000
50%       32.000000     89.000000  ...      9.000000      4.000000
75%       65.000000    100.000000  ...     51.000000      7.000000
max      100.000000    100.000000  ...    100.000000      9.000000

[8 rows x 17 columns]

In [ ]:
data.index

RangeIndex(start=0, stop=10992, step=1)

In [ ]:
# selecting data and slicing

data.input1

0        47
1         0
2         0
3         0
4         0
         ..
10987    36
10988    16
10989    56
10990    19
10991    38
Name: input1, Length: 10992, dtype: int64

In [ ]:
type(data.input1)

pandas.core.series.Series

In [ ]:
data['input1']

0        47
1         0
2         0
3         0
4         0
         ..
10987    36
10988    16
10989    56
10990    19
10991    38
Name: input1, Length: 10992, dtype: int64

In [ ]:
type(data['input1'])

pandas.core.series.Series

In [ ]:
data[['input1']]

       input1
0          47
1           0
2           0
3           0
4           0
...       ...
10987      36
10988      16
10989      56
10990      19
10991      38

[10992 rows x 1 columns]

In [ ]:
type(data[['input1']])

pandas.core.frame.DataFrame

In [ ]:
data[['input1','input2']]

       input1  input2
0          47     100
1           0      89
2           0      57
3           0     100
4           0      67
...       ...     ...
10987      36     100
10988      16      75
10989      56     100
10990      19     100
10991      38     100

[10992 rows x 2 columns]

In [ ]:
# [] slices the row

data[:4]

   input1  input2  input3  input4  ...  input14  input15  input16  class
0      47     100      27      81  ...       90       40       98      8
1       0      89      27     100  ...        2      100        6      2
2       0      57      31      68  ...       25       16        0      1
3       0     100       7      92  ...       23       67        0      4

[4 rows x 17 columns]

In [ ]:
data[7:14]

    input1  input2  input3  input4  ...  input14  input15  input16  class
7        0      39       2      62  ...      100        0       57      0
8       13      89      12      50  ...       94      100      100      5
9       57     100      22      72  ...       87       26       85      0
10      74      87      31     100  ...        0       18        1      9
11      48      96      62      65  ...      100        0       85      8
12     100     100      72      99  ...        0        0        2      5
13      91      74      54     100  ...        4       21        0      9

[7 rows x 17 columns]

In [ ]:
# selection by labels

data.loc[1]

input1       0.0
input2      89.0
input3      27.0
input4     100.0
input5      42.0
input6      75.0
input7      29.0
input8      45.0
input9      15.0
input10     15.0
input11     37.0
input12      0.0
input13     69.0
input14      2.0
input15    100.0
input16      6.0
class        2.0
Name: 1, dtype: float64

In [ ]:
data.loc[[1]]

   input1  input2  input3  input4  ...  input14  input15  input16  class
1       0      89      27     100  ...        2      100        6      2

[1 rows x 17 columns]

In [ ]:
data.loc[:3]

   input1  input2  input3  input4  ...  input14  input15  input16  class
0      47     100      27      81  ...       90       40       98      8
1       0      89      27     100  ...        2      100        6      2
2       0      57      31      68  ...       25       16        0      1
3       0     100       7      92  ...       23       67        0      4

[4 rows x 17 columns]

In [ ]:
data.loc[:3,['input1','input2','input3','input4']]

   input1  input2  input3  input4
0      47     100      27      81
1       0      89      27     100
2       0      57      31      68
3       0     100       7      92

In [ ]:
# selection by position  # iloc

data.iloc[1]

input1       0.0
input2      89.0
input3      27.0
input4     100.0
input5      42.0
input6      75.0
input7      29.0
input8      45.0
input9      15.0
input10     15.0
input11     37.0
input12      0.0
input13     69.0
input14      2.0
input15    100.0
input16      6.0
class        2.0
Name: 1, dtype: float64

In [ ]:
data.iloc[[1]]

   input1  input2  input3  input4  ...  input14  input15  input16  class
1       0      89      27     100  ...        2      100        6      2

[1 rows x 17 columns]

In [ ]:
data.iloc[:4,:4]

   input1  input2  input3  input4
0      47     100      27      81
1       0      89      27     100
2       0      57      31      68
3       0     100       7      92

In [ ]:
# filtering and selection data

data.head()

   input1  input2  input3  input4  ...  input14  input15  input16  class
0      47     100      27      81  ...       90       40       98      8
1       0      89      27     100  ...        2      100        6      2
2       0      57      31      68  ...       25       16        0      1
3       0     100       7      92  ...       23       67        0      4
4       0      67      49      83  ...       20       47        0      1

[5 rows x 17 columns]

In [ ]:
data['input2'] < 50

0        False
1        False
2        False
3        False
4        False
         ...
10987    False
10988    False
10989    False
10990    False
10991    False
Name: input2, Length: 10992, dtype: bool

In [ ]:
data[data['input2'] < 50]

       input1  input2  input3  input4  ...  input14  input15  input16  class
7           0      39       2      62  ...      100        0       57      0
21          0      46      49      64  ...       24       89        0      1
34          0       0      31      15  ...       82       79       64      9
137         0      42      30      56  ...       35       53        0      1
146         0      42      34      57  ...       28       45        0      1
...       ...     ...     ...     ...  ...      ...      ...      ...    ...
10805       0      43      32      58  ...       25       59        0      1
10866       0      42      40      60  ...       23       65        0      1
10879       0      45      42      70  ...        0      100        4      1
10880       0       3      29      24  ...       35       51        0      1
10933       0      15      29      40  ...       34       46        0      1

[379 rows x 17 columns]

In [ ]:
# missing values

data.isnull().sum()

input1       0
input2       0
input3       0
input4       0
input5       0
input6       0
input7       0
input8       0
input9       0
input10      0
input11    248
input12      0
input13      0
input14      0
input15      0
input16      0
class        0
dtype: int64

In [ ]:
data[data['input11'].isnull()]

       input1  input2  input3  input4  ...  input14  input15  input16  class
58         18      73       0      73  ...      100        5       84      0
87         47      93       1      67  ...      100        7       62      0
122        45     100      10      67  ...       95        0       61      0
164        21      75      40     100  ...        0        0       13      3
193        30     100       4      67  ...       82       64       93      0
...       ...     ...     ...     ...  ...      ...      ...      ...    ...
10717      56     100      38      69  ...       34       74        0      4
10870      80     100     100      97  ...       22        9       12      6
10889      47     100      35      95  ...       34       79        0      4
10908     100      72      77     100  ...        0        0        0      9
10947       6      83      99      86  ...       28       54        0      9

[248 rows x 17 columns]

In [ ]:
data['input11'] = data['input11'].fillna(0)

In [ ]:
data[data['input11'].isnull()]

Empty DataFrame
Columns: [input1, input2, input3, input4, input5, input6, input7, input8, input9, input10, input11, input12, input13, input14, input15, input16, class]
Index: []

In [ ]:
data = pd.read_csv('dataset_32_pendigits.csv')

In [ ]:
someVari = data['input11']

In [ ]:
someVari.fillna('mean')

0         56
1         37
2         50
3        100
4         40
        ...
10987     87
10988     21
10989    100
10990    100
10991    100
Name: input11, Length: 10992, dtype: object

In [ ]:
# mathematical operations

data['input1'].mean(),data['input1'].sum(),data['input1'].var()

(38.814319505094616, 426647, 1173.5956715594791)

In [ ]:
sampDatasetOf1 = pd.DataFrame(np.ones(10),columns = ['column1'])

In [ ]:
np.cumsum(sampDatasetOf1)

   column1
0      1.0
1      2.0
2      3.0
3      4.0
4      5.0
5      6.0
6      7.0
7      8.0
8      9.0
9     10.0

In [ ]:
np.cumsum(sampDatasetOf1['column1'])

0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
5     6.0
6     7.0
7     8.0
8     9.0
9    10.0
Name: column1, dtype: float64

In [ ]:
# map, apply, applymap in pandas
# it works on a series and supports functions, dictionary or series, and do the operation elementwise in the series

seriesObj = data['input1']
pandaDFseriesObj = data['input1']

In [ ]:
seriesObj.map(str)

0        47
1         0
2         0
3         0
4         0
         ..
10987    36
10988    16
10989    56
10990    19
10991    38
Name: input1, Length: 10992, dtype: object

In [ ]:
seriesObj.map(str).dtype

dtype('O')

In [ ]:
seriesObj.map(str)[0]

'47'

In [ ]:
dictCheck = {'a':10,'b':20,'c':30}

In [ ]:
sampNumpy = np.array(['a','b','c','a','b','c'])

In [ ]:
dataFSamp = pd.DataFrame(sampNumpy,columns = ['ColumnName'])

In [ ]:
dataFSamp

  ColumnName
0          a
1          b
2          c
3          a
4          b
5          c

In [ ]:
dataFSamp['ColumnName'].map(dictCheck)

0    10
1    20
2    30
3    10
4    20
5    30
Name: ColumnName, dtype: int64

In [ ]:
def checkFunct(x):
  return dictCheck[x]

In [ ]:
dataFSamp['ColumnName'].map(checkFunct)

0    10
1    20
2    30
3    10
4    20
5    30
Name: ColumnName, dtype: int64

In [ ]:
# apply
# applies function along any axis of the DataFrame, and also can be applied in series

seriesObj.dtype

dtype('int64')

In [ ]:
type(seriesObj)

pandas.core.series.Series

In [ ]:
data.apply(sum,axis = 1)

0        843.0
1        653.0
2        840.0
3        769.0
4        861.0
         ...
10987    855.0
10988    617.0
10989    862.0
10990    794.0
10991    753.0
Length: 10992, dtype: float64

In [ ]:
data.apply(sum)

input1     426647.0
input2     935642.0
input3     446337.0
input4     920846.0
input5     547076.0
input6     720780.0
input7     563013.0
input8     489133.0
input9     625099.0
input10    370386.0
input11         NaN
input12    382813.0
input13    604805.0
input14    384028.0
input15    519784.0
input16    317068.0
class       48712.0
dtype: float64

In [ ]:
data.apply(sum,axis = 0)

input1     426647.0
input2     935642.0
input3     446337.0
input4     920846.0
input5     547076.0
input6     720780.0
input7     563013.0
input8     489133.0
input9     625099.0
input10    370386.0
input11         NaN
input12    382813.0
input13    604805.0
input14    384028.0
input15    519784.0
input16    317068.0
class       48712.0
dtype: float64

In [ ]:
dataFSamp['ColumnName'].apply(checkFunct)

0    10
1    20
2    30
3    10
4    20
5    30
Name: ColumnName, dtype: int64

In [ ]:
# apply with LAMBDA
# a way to define functions without actually defining them

def checkFunc(x):
  if x < 10:
    return 'G10'
  elif x < 50:
    return 'G50'
  elif x < 90:
    return 'G90'
  else:
    return 'NO'

In [ ]:
data['input4'].apply(lambda x : checkFunc(x))

0        G90
1         NO
2        G90
3         NO
4        G90
        ...
10987    G90
10988     NO
10989    G90
10990    G90
10991    G90
Name: input4, Length: 10992, dtype: object

In [ ]:
data['input4'].map(checkFunc)

0        G90
1         NO
2        G90
3         NO
4        G90
        ...
10987    G90
10988     NO
10989    G90
10990    G90
10991    G90
Name: input4, Length: 10992, dtype: object

In [ ]:
data['input4'].apply(checkFunc)

0        G90
1         NO
2        G90
3         NO
4        G90
        ...
10987    G90
10988     NO
10989    G90
10990    G90
10991    G90
Name: input4, Length: 10992, dtype: object

In [ ]:
import datetime
a = datetime.datetime.now()
data['input4'].apply(checkFunc)
b = datetime.datetime.now()
print(b-a)

0:00:00.005834

In [ ]:
import datetime
a = datetime.datetime.now()
data['input4'].map(checkFunc)
b = datetime.datetime.now()
print(b-a)

0:00:00.006075

In [ ]:
import datetime
a = datetime.datetime.now()
data['input4'].apply(lambda x : checkFunc(x))
b = datetime.datetime.now()
print(b-a)

0:00:00.022008

In [ ]:
# ApplyMap: applies a function that accepts and returns a scalar to every elements of a dataframe

data.applymap(checkFunc).head()

  input1 input2 input3 input4 input5  ... input13 input14 input15 input16 class
0    G50     NO    G50    G90    G90  ...      NO      NO     G50      NO   G10
1    G10    G90    G50     NO    G50  ...     G90     G10      NO     G10   G10
2    G10    G90    G50    G90    G90  ...     G50     G50     G50     G10   G10
3    G10     NO    G10     NO    G10  ...     G90     G50     G90     G10   G10
4    G10    G90    G50    G90     NO  ...     G50     G50     G50     G10   G10

[5 rows x 17 columns]

In [ ]:
def someFunc(x,y):
  try:
    return (x/y)
  except:
    return 0

In [ ]:
data.head()

   input1  input2  input3  input4  ...  input14  input15  input16  class
0      47     100      27      81  ...       90       40       98      8
1       0      89      27     100  ...        2      100        6      2
2       0      57      31      68  ...       25       16        0      1
3       0     100       7      92  ...       23       67        0      4
4       0      67      49      83  ...       20       47        0      1

[5 rows x 17 columns]

In [ ]:
data[["input3","input4"]].apply(lambda x : someFunc(*x), axis=1)

0        0.333333
1        0.270000
2        0.455882
3        0.076087
4        0.590361
           ...
10987    0.342857
10988    0.410000
10989    0.341772
10990    0.000000
10991    0.456790
Length: 10992, dtype: float64

In [ ]:
# Merge(join), Concat / append in pandas

table1 = pd.DataFrame(data={'column1':[1,2,3,4],'column2':[5,6,7,8]})
table2 = pd.DataFrame(data={'column1':[9,10,11,12],'column2':[13,14,15,16]})
table3 = pd.DataFrame(data={'column3':[1,1,2,2],'column4':[5,6,7,8]})

In [ ]:
pd.concat([table1,table2])

   column1  column2
0        1        5
1        2        6
2        3        7
3        4        8
0        9       13
1       10       14
2       11       15
3       12       16

In [ ]:
table1.append(table2)

   column1  column2
0        1        5
1        2        6
2        3        7
3        4        8
0        9       13
1       10       14
2       11       15
3       12       16

In [ ]:
pd.concat([table1,table3])

   column1  column2  column3  column4
0      1.0      5.0      NaN      NaN
1      2.0      6.0      NaN      NaN
2      3.0      7.0      NaN      NaN
3      4.0      8.0      NaN      NaN
0      NaN      NaN      1.0      5.0
1      NaN      NaN      1.0      6.0
2      NaN      NaN      2.0      7.0
3      NaN      NaN      2.0      8.0

In [ ]:
pd.concat([table1,table3],axis=1)

   column1  column2  column3  column4
0        1        5        1        5
1        2        6        1        6
2        3        7        2        7
3        4        8        2        8

In [ ]:
# Merge

pd.merge(table1,table3,left_on=["column1"],right_on=["column3"],how="left")

   column1  column2  column3  column4
0        1        5      1.0      5.0
1        1        5      1.0      6.0
2        2        6      2.0      7.0
3        2        6      2.0      8.0
4        3        7      NaN      NaN
5        4        8      NaN      NaN

In [ ]:
pd.merge(table1,table3,left_on=["column1"],right_on=["column3"],how="inner")

   column1  column2  column3  column4
0        1        5        1        5
1        1        5        1        6
2        2        6        2        7
3        2        6        2        8

In [ ]:
# Learning by example

from google.colab import files
upload = files.upload()

Saving Sample - Superstore.xls to Sample - Superstore.xls

In [ ]:
salesData = pd.read_excel('Sample - Superstore.xls')
salesData.head(2)

   Row ID        Order ID Order Date  ... Quantity Discount    Profit
0       1  CA-2016-152156 2016-11-08  ...        2      0.0   41.9136
1       2  CA-2016-152156 2016-11-08  ...        3      0.0  219.5820

[2 rows x 21 columns]

In [ ]:
salesData.columns

Index(['Row ID', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Customer Name', 'Segment', 'Country', 'City', 'State',
       'Postal Code', 'Region', 'Product ID', 'Category', 'Sub-Category',
       'Product Name', 'Sales', 'Quantity', 'Discount', 'Profit'],
      dtype='object')

In [ ]:
salesData.shape

(9994, 21)

In [ ]:
salesData.describe()

            Row ID   Postal Code  ...     Discount       Profit
count  9994.000000   9994.000000  ...  9994.000000  9994.000000
mean   4997.500000  55190.379428  ...     0.156203    28.656896
std    2885.163629  32063.693350  ...     0.206452   234.260108
min       1.000000   1040.000000  ...     0.000000 -6599.978000
25%    2499.250000  23223.000000  ...     0.000000     1.728750
50%    4997.500000  56430.500000  ...     0.200000     8.666500
75%    7495.750000  90008.000000  ...     0.200000    29.364000
max    9994.000000  99301.000000  ...     0.800000  8399.976000

[8 rows x 6 columns]

In [ ]:
# total of unique products that we got

np.unique(salesData['Product ID'])

array(['FUR-BO-10000112', 'FUR-BO-10000330', 'FUR-BO-10000362', ...,
       'TEC-PH-10004924', 'TEC-PH-10004959', 'TEC-PH-10004977'],
      dtype=object)

In [ ]:
len(pd.unique(salesData['Product ID']))

1862

In [ ]:
salesData.dtypes

Row ID                    int64
Order ID                 object
Order Date       datetime64[ns]
Ship Date        datetime64[ns]
Ship Mode                object
Customer ID              object
Customer Name            object
Segment                  object
Country                  object
City                     object
State                    object
Postal Code               int64
Region                   object
Product ID               object
Category                 object
Sub-Category             object
Product Name             object
Sales                   float64
Quantity                  int64
Discount                float64
Profit                  float64
dtype: object

In [ ]:
for col in salesData.columns:   # unique value for each column
  print(col,'-',len(np.unique(salesData[col])))

Row ID - 9994
Order ID - 5009
Order Date - 1237
Ship Date - 1334
Ship Mode - 4
Customer ID - 793
Customer Name - 793
Segment - 3
Country - 1
City - 531
State - 49
Postal Code - 631
Region - 4
Product ID - 1862
Category - 3
Sub-Category - 17
Product Name - 1850
Sales - 6144
Quantity - 14
Discount - 12
Profit - 7545

In [ ]:
salesData.head(1)

   Row ID        Order ID Order Date  ... Quantity Discount   Profit
0       1  CA-2016-152156 2016-11-08  ...        2      0.0  41.9136

[1 rows x 21 columns]

In [ ]:
salesData.columns

Index(['Row ID', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Customer Name', 'Segment', 'Country', 'City', 'State',
       'Postal Code', 'Region', 'Product ID', 'Category', 'Sub-Category',
       'Product Name', 'Sales', 'Quantity', 'Discount', 'Profit'],
      dtype='object')

In [ ]:
# Pivot Tables

savemeanInfo = pd.pivot_table(salesData,index='Sub-Category', values=['Sales','Profit'],aggfunc='mean').reset_index()

In [ ]:
saveVarInfo = pd.pivot_table(salesData,index='Sub-Category', values=['Sales','Profit'],aggfunc='var').reset_index()

In [ ]:
savemeanInfo.columns=['Sub-Category','MeanProfitVar','meanSalesVar']
saveVarInfo.columns=['Sub-Category','MeanProfitVar','meanSalesVar']

In [ ]:
savemeanInfo.head()

  Sub-Category  MeanProfitVar  meanSalesVar
0  Accessories      54.111788    215.974604
1   Appliances      38.922758    230.755710
2          Art       8.200737     34.068834
3      Binders      19.843574    133.560560
4    Bookcases     -15.230509    503.859633

In [ ]:
saveVarInfo.head()

  Sub-Category  MeanProfitVar   meanSalesVar
0  Accessories   11268.980678  112201.561297
1   Appliances   21998.569064  151281.824990
2          Art     179.138522    3614.710848
3      Binders   93756.463673  317251.900262
4    Bookcases   33136.458879  407999.675401

In [ ]:
salesData.head(1)

   Row ID        Order ID Order Date  ... Quantity Discount   Profit
0       1  CA-2016-152156 2016-11-08  ...        2      0.0  41.9136

[1 rows x 21 columns]

In [ ]:
salesData.columns

Index(['Row ID', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Customer Name', 'Segment', 'Country', 'City', 'State',
       'Postal Code', 'Region', 'Product ID', 'Category', 'Sub-Category',
       'Product Name', 'Sales', 'Quantity', 'Discount', 'Profit'],
      dtype='object')

In [ ]:
savemeanInfo = salesData.pivot_table(index='Sub-Category',values=['Sales','Profit'],aggfunc='mean').reset_index()

In [ ]:
saveSTDVarInfo=salesData.pivot_table(index='Sub-Category',values=['Sales','Profit'],aggfunc='std').reset_index()

In [ ]:
savemeanInfo.columns=['Sub-Category','MeanProfitVar','meanSalesVar']
saveSTDVarInfo.columns=['Sub-Category','STDProfitVar','STDSalesVar']

In [ ]:
savTheTable=pd.merge(savemeanInfo,saveSTDVarInfo,on=['Sub-Category'],how='left')
savTheTable

   Sub-Category  MeanProfitVar  meanSalesVar  STDProfitVar  STDSalesVar
0   Accessories      54.111788    215.974604    106.155455   334.965015
1    Appliances      38.922758    230.755710    148.319146   388.949643
2           Art       8.200737     34.068834     13.384264    60.122465
3       Binders      19.843574    133.560560    306.196773   563.251188
4     Bookcases     -15.230509    503.859633    182.034224   638.748523
5        Chairs      43.095894    532.332420    127.099922   550.148243
6       Copiers     817.909190   2198.941618   1460.921156  3175.665867
7     Envelopes      27.418019     64.867724     35.354983    84.351633
8     Fasteners       4.375660     13.936774      5.055053    12.416593
9   Furnishings      13.645918     95.825668     52.753228   147.893640
10       Labels      15.236962     34.303055     34.084127    74.119287
11     Machines      29.432669   1645.553313   1099.070067  2765.102088
12        Paper      24.856620     57.284092     35.225214    78.167639
13       Phones      50.073938    371.211534    113.251277   491.457343
14      Storage      25.152277    264.590553     81.923600   355.222507
15     Supplies      -6.258418    245.650200    105.059628   923.828753
16       Tables     -55.565771    648.794771    230.565006   615.774655

In [ ]:
savTheTable['diffMean'] = savTheTable['MeanProfitVar']-savTheTable['STDProfitVar']

In [ ]:
savTheTable['diffSTD'] = savTheTable['meanSalesVar']-savTheTable['STDSalesVar']

In [ ]:
savTheTable

   Sub-Category  MeanProfitVar  ...     diffMean      diffSTD
0   Accessories      54.111788  ...   -52.043667  -118.990411
1    Appliances      38.922758  ...  -109.396388  -158.193933
2           Art       8.200737  ...    -5.183527   -26.053631
3       Binders      19.843574  ...  -286.353199  -429.690627
4     Bookcases     -15.230509  ...  -197.264733  -134.888890
5        Chairs      43.095894  ...   -84.004028   -17.815823
6       Copiers     817.909190  ...  -643.011967  -976.724250
7     Envelopes      27.418019  ...    -7.936964   -19.483908
8     Fasteners       4.375660  ...    -0.679393     1.520181
9   Furnishings      13.645918  ...   -39.107310   -52.067972
10       Labels      15.236962  ...   -18.847165   -39.816232
11     Machines      29.432669  ... -1069.637398 -1119.548775
12        Paper      24.856620  ...   -10.368594   -20.883547
13       Phones      50.073938  ...   -63.177339  -120.245808
14      Storage      25.152277  ...   -56.771323   -90.631953
15     Supplies      -6.258418  ...  -111.318047  -678.178553
16       Tables     -55.565771  ...  -286.130778    33.020116

[17 rows x 7 columns]

In [ ]:
savTheTable.sort_values(by=['diffMean'],ascending=False)

   Sub-Category  MeanProfitVar  ...     diffMean      diffSTD
8     Fasteners       4.375660  ...    -0.679393     1.520181
2           Art       8.200737  ...    -5.183527   -26.053631
7     Envelopes      27.418019  ...    -7.936964   -19.483908
12        Paper      24.856620  ...   -10.368594   -20.883547
10       Labels      15.236962  ...   -18.847165   -39.816232
9   Furnishings      13.645918  ...   -39.107310   -52.067972
0   Accessories      54.111788  ...   -52.043667  -118.990411
14      Storage      25.152277  ...   -56.771323   -90.631953
13       Phones      50.073938  ...   -63.177339  -120.245808
5        Chairs      43.095894  ...   -84.004028   -17.815823
1    Appliances      38.922758  ...  -109.396388  -158.193933
15     Supplies      -6.258418  ...  -111.318047  -678.178553
4     Bookcases     -15.230509  ...  -197.264733  -134.888890
16       Tables     -55.565771  ...  -286.130778    33.020116
3       Binders      19.843574  ...  -286.353199  -429.690627
6       Copiers     817.909190  ...  -643.011967  -976.724250
11     Machines      29.432669  ... -1069.637398 -1119.548775

[17 rows x 7 columns]

In [ ]:
# Identify the Sub-Categories where Top 20 customers that have sales more than the other Sub-Categories in the same region.

salesData.head(1)

   Row ID        Order ID Order Date  ... Quantity Discount   Profit
0       1  CA-2016-152156 2016-11-08  ...        2      0.0  41.9136

[1 rows x 21 columns]

In [ ]:
customerName = pd.pivot_table(salesData,index=['Customer ID'], values=['Sales'],aggfunc='sum').reset_index().sort_values(by='Sales',ascending=False).head(20)['Customer ID'].values

In [ ]:
pd.unique(salesData['Region'])

array(['South', 'West', 'Central', 'East'], dtype=object)

In [ ]:
filtData = salesData[(salesData['Customer ID'].isin(customerName)) & (salesData['Region']=='South')]

In [ ]:
pd.pivot_table(filtData, index='Sub-Category',values=['Sales'])

                     Sales
Sub-Category
Accessories     498.000000
Art              11.260750
Binders         427.466167
Bookcases       145.740000
Chairs         1667.744000
Envelopes        23.340000
Fasteners        25.028000
Furnishings     156.064286
Labels           15.750000
Machines      10736.576667
Paper            17.522800
Phones          417.548000
Storage         193.770000
Supplies          3.328000
Tables          693.101000

In [ ]:
# same solution but this method shows ALL regions to compare to.
filtData = salesData[(salesData['Customer ID'].isin(customerName))]

In [ ]:
savThePivT = pd.pivot_table(filtData, index='Sub-Category',columns=['Region'],values=['Sales'])

In [ ]:
savThePivT.columns

MultiIndex([('Sales', 'Central'),
            ('Sales',    'East'),
            ('Sales',   'South'),
            ('Sales',    'West')],
           names=[None, 'Region'])

In [ ]:
savThePivT.columns=[''.join(i) for i in savThePivT.columns]

In [ ]:
savThePivT.head()

              SalesCentral   SalesEast  SalesSouth   SalesWest
Sub-Category
Accessories      36.027000  100.938889  498.000000  125.175667
Appliances      122.191000  222.697200         NaN  207.082500
Art              26.999111   49.739091   11.260750   39.927200
Binders        1486.914267  274.165625  427.466167   41.815200
Bookcases      1023.332000  995.506800  145.740000  413.488500

In [ ]:
savThePivT.sort_values(by='SalesCentral')

              SalesCentral    SalesEast    SalesSouth    SalesWest
Sub-Category
Labels           11.960000    44.400000     15.750000    21.170000
Fasteners        15.692000     4.360000     25.028000     7.280000
Art              26.999111    49.739091     11.260750    39.927200
Envelopes        35.093333    58.206000     23.340000    92.630000
Accessories      36.027000   100.938889    498.000000   125.175667
Paper            39.236286    41.751500     17.522800    88.103125
Appliances      122.191000   222.697200           NaN   207.082500
Furnishings     129.247500    88.888182    156.064286   102.971250
Storage         189.164500   447.360000    193.770000   199.485400
Supplies        197.585000    18.153000      3.328000  2983.951200
Tables          481.096250   199.836000    693.101000   647.938500
Phones          515.872444   452.395571    417.548000   948.608800
Chairs         1016.881667   787.300846   1667.744000   576.258667
Bookcases      1023.332000   995.506800    145.740000   413.488500
Binders        1486.914267   274.165625    427.466167    41.815200
Machines       4223.931000  4919.940000  10736.576667  1553.480000
Copiers       10149.955000  7674.971000           NaN  8399.960000

In [ ]:
# Group by

salesData.groupby('Region').sum()[['Profit']]

              Profit
Region
Central   39706.3625
East      91522.7800
South     46749.4303
West     108418.4489

In [ ]:
salesData.groupby(['Region','Customer ID']).sum().head(5)

                     Row ID  Postal Code  ...  Discount    Profit
Region  Customer ID                       ...
Central AA-10315      23123       425470  ...       0.8 -650.5971
        AA-10375       1617       136208  ...       0.0   62.0658
        AA-10480      54075       570205  ...       0.0  420.4986
        AA-10645      24027       219360  ...       0.0  439.3138
        AB-10015      25828       222257  ...       0.2  114.3432

[5 rows x 6 columns]

In [ ]:
salesData.groupby(['Region','Customer ID']).agg({'Sales':'var','Profit':'std'}).reset_index()

       Region Customer ID         Sales      Profit
0     Central    AA-10315  2.391345e+06  333.653062
1     Central    AA-10375  7.389632e+03   28.223319
2     Central    AA-10480  3.360151e+04   52.929506
3     Central    AA-10645  3.807022e+05  206.878156
4     Central    AB-10015  2.778122e+04   35.390674
...       ...         ...           ...         ...
2496     West    XP-21865  7.591865e+03   42.429516
2497     West    YC-21895  7.012548e+05  260.164030
2498     West    YS-21880  8.956381e+05  345.634555
2499     West    ZC-21910  1.233752e+05   85.120354
2500     West    ZD-21925  8.832815e+03    6.864926

[2501 rows x 4 columns]

In [ ]:
salesData.columns

Index(['Row ID', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Customer Name', 'Segment', 'Country', 'City', 'State',
       'Postal Code', 'Region', 'Product ID', 'Category', 'Sub-Category',
       'Product Name', 'Sales', 'Quantity', 'Discount', 'Profit'],
      dtype='object')

In [ ]:
# error (kiv)
# to do two different operations on the same column
saveToEdit = salesData.groupby(['Region','Customer ID']).agg({'Sales':{'samValSales':'sum','varvalSales':'var'},'Profit':{'profitSum':'sum'}}).reset_index()

SpecificationError: ignored

In [ ]:
# Conversion

xData = pd.DataFrame(data={'col1':[1,2,3,4]})

In [ ]:
xData.dtypes

col1    int64
dtype: object

In [ ]:
xData.astype('int32')

   col1
0     1
1     2
2     3
3     4

In [ ]:
xData.astype('int32').dtypes

col1    int32
dtype: object

In [ ]:
xData.astype('category')

  col1
0    1
1    2
2    3
3    4

In [ ]:
xData.astype('category').dtypes

col1    category
dtype: object

In [ ]:
# Operations with Strings

salesData.head(1)

   Row ID        Order ID Order Date  ... Quantity Discount   Profit
0       1  CA-2016-152156 2016-11-08  ...        2      0.0  41.9136

[1 rows x 21 columns]

In [ ]:
salesData['Ship Mode'].str.split(' ').head(5)

0      [Second, Class]
1      [Second, Class]
2      [Second, Class]
3    [Standard, Class]
4    [Standard, Class]
Name: Ship Mode, dtype: object

In [ ]:
salesData['Ship Mode'].str.contains(' ').head(5)

0    True
1    True
2    True
3    True
4    True
Name: Ship Mode, dtype: bool

In [ ]:
salesData['Ship Mode'].str.contains('Class').head(5)

0    True
1    True
2    True
3    True
4    True
Name: Ship Mode, dtype: bool

In [ ]:
salesData['Ship Mode'].str.replace(' ','$').head(5)

0      Second$Class
1      Second$Class
2      Second$Class
3    Standard$Class
4    Standard$Class
Name: Ship Mode, dtype: object

In [ ]:
salesData['Ship Mode'].str.startswith('Sec').head(5)

0     True
1     True
2     True
3    False
4    False
Name: Ship Mode, dtype: bool